Revit 2027 API
Wall.RemoveAttachment Method
Overload List
Name | Description
RemoveAttachment(ElementId) |  Removes any attachment of the wall to the specified target.
RemoveAttachment(ElementId, AttachmentLocation) |  Removes an attachment at the top or base of a wall, if there is one.
Top
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace